import { CalendarEvent } from "@/components/shared/custom-calendar";

export const mockCalendarEvents: Record<string, CalendarEvent[]> = {
  "2024-09-03": [
    {
      id: "1",
      venue: "언플러그드 라운지",
      artists: ["쿠인", "심각한 개구리", "황찬욱"],
    },
  ],
  "2024-09-04": [
    {
      id: "2",
      venue: "언플러그드 라운지",
      artists: ["쿠인", "심각한 개구리", "황찬욱"],
    },
  ],
  "2024-09-05": [
    {
      id: "3",
      venue: "현대카드 언더스테이지",
      artists: ["와와와놀이도감"],
    },
    {
      id: "4",
      venue: "현대카드 언더스테이지",
      artists: ["와와와놀이도감"],
    },
    {
      id: "5",
      venue: "현대카드 언더스테이지",
      artists: ["와와와놀이도감"],
    },
    {
      id: "6",
      venue: "현대카드 언더스테이지",
      artists: ["와와와놀이도감"],
    },
    {
      id: "7",
      venue: "현대카드 언더스테이지",
      artists: ["와와와놀이도감"],
    },
    {
      id: "8",
      venue: "현대카드 언더스테이지",
      artists: ["와와와놀이도감"],
    },
    {
      id: "9",
      venue: "현대카드 언더스테이지",
      artists: ["와와와놀이도감"],
    },
    {
      id: "10",
      venue: "현대카드 언더스테이지",
      artists: ["와와와놀이도감"],
    },
    {
      id: "11",
      venue: "현대카드 언더스테이지",
      artists: ["와와와놀이도감"],
    },
    {
      id: "12",
      venue: "현대카드 언더스테이지",
      artists: ["와와와놀이도감"],
    },
    {
      id: "13",
      venue: "현대카드 언더스테이지",
      artists: ["와와와놀이도감"],
    },
    {
      id: "14",
      venue: "현대카드 언더스테이지",
      artists: ["와와와놀이도감"],
    },
    {
      id: "15",
      venue: "현대카드 언더스테이지",
      artists: ["와와와놀이도감"],
    },
    {
      id: "16",
      venue: "현대카드 언더스테이지",
      artists: ["와와와놀이도감"],
    },
    {
      id: "17",
      venue: "현대카드 언더스테이지",
      artists: ["와와와놀이도감"],
    },
    {
      id: "18",
      venue: "현대카드 언더스테이지",
      artists: ["와와와놀이도감"],
    },
  ],
  "2024-09-06": [
    {
      id: "7",
      venue: "언플러그드 라운지",
      artists: ["쿠인", "심각한 개구리", "황찬욱"],
    },
  ],
  "2024-09-07": [
    {
      id: "8",
      venue: "현대카드 언더스테이지",
      artists: ["와와와놀이도감"],
    },
    {
      id: "9",
      venue: "현대카드 언더스테이지",
      artists: ["와와와놀이도감"],
    },
    {
      id: "10",
      venue: "현대카드 언더스테이지",
      artists: ["와와와놀이도감"],
    },
    {
      id: "11",
      venue: "현대카드 언더스테이지",
      artists: ["와와와놀이도감"],
    },
  ],
  "2024-09-08": [
    {
      id: "12",
      venue: "현대카드 언더스테이지",
      artists: ["와와와놀이도감"],
    },
    {
      id: "13",
      venue: "현대카드 언더스테이지",
      artists: ["와와와놀이도감"],
    },
    {
      id: "14",
      venue: "현대카드 언더스테이지",
      artists: ["와와와놀이도감"],
    },
    {
      id: "15",
      venue: "현대카드 언더스테이지",
      artists: ["와와와놀이도감"],
    },
  ],
  "2024-09-12": [
    {
      id: "16",
      venue: "언플러그드 라운지",
      artists: ["쿠인", "심각한 개구리", "황찬욱"],
    },
    {
      id: "17",
      venue: "현대카드 언더스테이지",
      artists: ["와와와놀이도감"],
    },
    {
      id: "18",
      venue: "현대카드 언더스테이지",
      artists: ["와와와놀이도감"],
    },
    {
      id: "19",
      venue: "현대카드 언더스테이지",
      artists: ["와와와놀이도감"],
    },
  ],
  "2024-09-13": [
    {
      id: "20",
      venue: "현대카드 언더스테이지",
      artists: ["와와와놀이도감"],
    },
    {
      id: "21",
      venue: "현대카드 언더스테이지",
      artists: ["와와와놀이도감"],
    },
    {
      id: "22",
      venue: "현대카드 언더스테이지",
      artists: ["와와와놀이도감"],
    },
    {
      id: "23",
      venue: "현대카드 언더스테이지",
      artists: ["와와와놀이도감"],
    },
  ],
  "2024-09-14": [
    {
      id: "24",
      venue: "언플러그드 라운지",
      artists: ["쿠인", "심각한 개구리", "황찬욱"],
    },
  ],
  "2024-09-16": [
    {
      id: "25",
      venue: "언플러그드 라운지",
      artists: ["쿠인", "심각한 개구리", "황찬욱"],
    },
  ],
  "2024-09-18": [
    {
      id: "26",
      venue: "언플러그드 라운지",
      artists: ["쿠인", "심각한 개구리", "황찬욱"],
    },
  ],
  "2024-09-20": [
    {
      id: "27",
      venue: "언플러그드 라운지",
      artists: ["쿠인", "심각한 개구리", "황찬욱"],
    },
  ],
  "2024-09-21": [
    {
      id: "28",
      venue: "현대카드 언더스테이지",
      artists: ["와와와놀이도감"],
    },
    {
      id: "29",
      venue: "현대카드 언더스테이지",
      artists: ["와와와놀이도감"],
    },
    {
      id: "30",
      venue: "현대카드 언더스테이지",
      artists: ["와와와놀이도감"],
    },
    {
      id: "31",
      venue: "현대카드 언더스테이지",
      artists: ["와와와놀이도감"],
    },
  ],
  "2024-09-23": [
    {
      id: "32",
      venue: "현대카드 언더스테이지",
      artists: ["와와와놀이도감"],
    },
    {
      id: "33",
      venue: "현대카드 언더스테이지",
      artists: ["와와와놀이도감"],
    },
    {
      id: "34",
      venue: "현대카드 언더스테이지",
      artists: ["와와와놀이도감"],
    },
    {
      id: "35",
      venue: "현대카드 언더스테이지",
      artists: ["와와와놀이도감"],
    },
  ],
  "2024-09-24": [
    {
      id: "36",
      venue: "현대카드 언더스테이지",
      artists: ["와와와놀이도감"],
    },
    {
      id: "37",
      venue: "현대카드 언더스테이지",
      artists: ["와와와놀이도감"],
    },
    {
      id: "38",
      venue: "현대카드 언더스테이지",
      artists: ["와와와놀이도감"],
    },
    {
      id: "39",
      venue: "현대카드 언더스테이지",
      artists: ["와와와놀이도감"],
    },
  ],
  "2024-09-25": [
    {
      id: "40",
      venue: "현대카드 언더스테이지",
      artists: ["와와와놀이도감"],
    },
    {
      id: "41",
      venue: "현대카드 언더스테이지",
      artists: ["와와와놀이도감"],
    },
    {
      id: "42",
      venue: "현대카드 언더스테이지",
      artists: ["와와와놀이도감"],
    },
    {
      id: "43",
      venue: "현대카드 언더스테이지",
      artists: ["와와와놀이도감"],
    },
  ],
  "2024-09-26": [
    {
      id: "44",
      venue: "언플러그드 라운지",
      artists: ["쿠인", "심각한 개구리", "황찬욱"],
    },
  ],
  "2024-09-27": [
    {
      id: "45",
      venue: "현대카드 언더스테이지",
      artists: ["와와와놀이도감"],
    },
    {
      id: "46",
      venue: "현대카드 언더스테이지",
      artists: ["와와와놀이도감"],
    },
    {
      id: "47",
      venue: "현대카드 언더스테이지",
      artists: ["와와와놀이도감"],
    },
    {
      id: "48",
      venue: "현대카드 언더스테이지",
      artists: ["와와와놀이도감"],
    },
  ],
  "2024-09-28": [
    {
      id: "49",
      venue: "언플러그드 라운지",
      artists: ["쿠인", "심각한 개구리", "황찬욱"],
    },
  ],
  "2024-09-30": [
    {
      id: "50",
      venue: "언플러그드 라운지",
      artists: ["쿠인", "심각한 개구리", "황찬욱"],
    },
  ],
};
